from datetime import timedelta

TEST_ALARM_TIME = timedelta(minutes=11)
NEXT_TEST_ALARM_AFTER = timedelta(minutes=1)
TEST_NAME = f"Перевірка. Тривалість тривоги - {TEST_ALARM_TIME}. Час до наступної тривоги - {NEXT_TEST_ALARM_AFTER}."
_REGIONS = [
    {
        "id": -1,
        "name": "-",
    },
    {
        "id": 0,
        "name": TEST_NAME,
    },
    {
        "id": 1,
        "name": "Вінницька область",
    },
    {
        "id": 2,
        "name": "Волинська область",
    },
    {
        "id": 3,
        "name": "Дніпропетровська область",
    },
    {
        "id": 4,
        "name": "Донецька область",
    },
    {
        "id": 5,
        "name": "Житомирська область",
    },
    {
        "id": 6,
        "name": "Закарпатська область",
    },
    {
        "id": 7,
        "name": "Запорізька область",
    },
    {
        "id": 8,
        "name": "Івано-Франківська область",
    },
    {
        "id": 9,
        "name": "Київська область",
    },
    {
        "id": 10,
        "name": "Кіровоградська область",
    },
    {
        "id": 11,
        "name": "Луганська область",
    },
    {
        "id": 12,
        "name": "Львівська область",
    },
    {
        "id": 13,
        "name": "Миколаївська область",
    },
    {
        "id": 14,
        "name": "Одеська область",
    },
    {
        "id": 15,
        "name": "Полтавська область",
    },
    {
        "id": 16,
        "name": "Рівненська область",
    },
    {
        "id": 17,
        "name": "Сумська область",
    },
    {
        "id": 18,
        "name": "Тернопільська область",
    },
    {
        "id": 19,
        "name": "Харківська область",
    },
    {
        "id": 20,
        "name": "Херсонська область",
    },
    {
        "id": 21,
        "name": "Хмельницька область",
    },
    {
        "id": 22,
        "name": "Черкаська область",
    },
    {
        "id": 23,
        "name": "Чернівецька область",
    },
    {
        "id": 24,
        "name": "Чернігівська область",
    },
    {
        "id": 25,
        "name": "м. Київ",
    },
]
NAMES = {state["id"]: state["name"] for state in _REGIONS}
IDS = {state["name"]: state["id"] for state in _REGIONS}
LIST = list(IDS.keys())
